Revit 2024 API
UIMacroManager.MacroManager Property
 The DB macro manager.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public MacroManager MacroManager { get; }
Visual Basic
Public ReadOnly Property MacroManager As MacroManager
	Get
Visual C++
public:
property MacroManager^ MacroManager {
	MacroManager^ get ();
}
See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace